20230128103940-atcoder.org
:PROPERTIES:
:ID:       8f49e829-109c-45b0-a835-3fe88c1282ea
:END:
#+title: AtCoder
* 概要
競プロのウェブサイト。
* Memo
* Tasks
** TODO Cat
:LOGBOOK:
CLOCK: [2023-01-28 Sat 10:53]--[2023-01-28 Sat 11:18] =>  0:25
:END:
- [[https://atcoder.jp/contests/abc286/tasks/abc286_b][B - Cat]]

うまくいってそうなのだが、提出では失敗。

#+caption: テスト
#+begin_src go
func cat(s string) string {
	return strings.Replace(s, "na", "nya", -1)
}

func TestCat(t *testing.T) {
	var s string
	fmt.Scanf("%d\n%s", 1, &s)

	assert.Equal(t, "nyaan", cat("naan"))
	assert.Equal(t, "nyationyal", cat("national"))
	fmt.Println(cat("national"))
}
#+end_src

#+begin_src go
package main

import "fmt"
import "strings"

func main() {
  var s string
  fmt.Scanf("%d\n%s",1, &s)

  result := strings.Replace(s, "na", "nya", -1)
  fmt.Println(result)
}
#+end_src
** TODO [[https://qiita.com/go_sagawa/items/bc83c9c781be29b5bd88][GoでAtCoderをやる話 - Qiita]]
ブラウザではやりにくいので、準備する。
* Reference
** [[https://qiita.com/e869120/items/eb50fdaece12be418faa][レッドコーダーが教える、競プロ・AtCoder上達のガイドライン【中級編：目指せ水色コーダー！】 - Qiita]]
練習。
* Archives
