20230128103940-atcoder.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-02-15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>AtCoder</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">AtCoder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c2f082">概要</a></li>
<li><a href="#org2b3ac27">Memo</a></li>
<li><a href="#org6dafeee">Tasks</a>
<ul>
<li><a href="#org90279ad"><span class="todo TODO">TODO</span> Cat</a></li>
<li><a href="#orgecd1665"><span class="todo TODO">TODO</span> GoでAtCoderをやる話 - Qiita</a></li>
</ul>
</li>
<li><a href="#org99166cb">Reference</a>
<ul>
<li><a href="#org263faa0">レッドコーダーが教える、競プロ・AtCoder上達のガイドライン【中級編：目指せ水色コーダー！】 - Qiita</a></li>
</ul>
</li>
<li><a href="#orgb1ad689">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7c2f082" class="outline-2">
<h2 id="org7c2f082"><a href="#org7c2f082">概要</a></h2>
<div class="outline-text-2" id="text-org7c2f082">
<p>
競プロのウェブサイト。
</p>
</div>
</div>
<div id="outline-container-org2b3ac27" class="outline-2">
<h2 id="org2b3ac27"><a href="#org2b3ac27">Memo</a></h2>
</div>
<div id="outline-container-org6dafeee" class="outline-2">
<h2 id="org6dafeee"><a href="#org6dafeee">Tasks</a></h2>
<div class="outline-text-2" id="text-org6dafeee">
</div>
<div id="outline-container-org90279ad" class="outline-3">
<h3 id="org90279ad"><a href="#org90279ad"><span class="todo TODO">TODO</span> Cat</a></h3>
<div class="outline-text-3" id="text-org90279ad">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc286/tasks/abc286_b">B - Cat</a></li>
</ul>

<p>
うまくいってそうなのだが、提出では失敗。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>テスト</label><pre class="src src-go">func cat(s string) string {
	return strings.Replace(s, "na", "nya", -1)
}

func TestCat(t *testing.T) {
	var s string
	fmt.Scanf("%d\n%s", 1, &amp;s)

	assert.Equal(t, "nyaan", cat("naan"))
	assert.Equal(t, "nyationyal", cat("national"))
	fmt.Println(cat("national"))
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-go">package main

import "fmt"
import "strings"

func main() {
  var s string
  fmt.Scanf("%d\n%s",1, &amp;s)

  result := strings.Replace(s, "na", "nya", -1)
  fmt.Println(result)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgecd1665" class="outline-3">
<h3 id="orgecd1665"><a href="#orgecd1665"><span class="todo TODO">TODO</span> <a href="https://qiita.com/go_sagawa/items/bc83c9c781be29b5bd88">GoでAtCoderをやる話 - Qiita</a></a></h3>
<div class="outline-text-3" id="text-orgecd1665">
<p>
ブラウザではやりにくいので、準備する。
</p>
</div>
</div>
</div>
<div id="outline-container-org99166cb" class="outline-2">
<h2 id="org99166cb"><a href="#org99166cb">Reference</a></h2>
<div class="outline-text-2" id="text-org99166cb">
</div>
<div id="outline-container-org263faa0" class="outline-3">
<h3 id="org263faa0"><a href="#org263faa0"><a href="https://qiita.com/e869120/items/eb50fdaece12be418faa">レッドコーダーが教える、競プロ・AtCoder上達のガイドライン【中級編：目指せ水色コーダー！】 - Qiita</a></a></h3>
<div class="outline-text-3" id="text-org263faa0">
<p>
練習。
</p>
</div>
</div>
</div>
<div id="outline-container-orgb1ad689" class="outline-2">
<h2 id="orgb1ad689"><a href="#orgb1ad689">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
